Tekla Open API Reference for Tekla Structures 2025
InsidePartAlongPartOrWithLeaderLinePlacingType Class
 The InsidePartAlongPartOrWithLeaderLinePlacingType class defines a placing type that places the object using the base line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line. The base line used is in the middle of the part, aligned with the part.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.InsidePartAlongPartOrWithLeaderLinePlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class InsidePartAlongPartOrWithLeaderLinePlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class InsidePartAlongPartOrWithLeaderLinePlacingType
	Inherits PreferredPlacingTypeBase
The InsidePartAlongPartOrWithLeaderLinePlacingType type exposes the following members.
Constructors
Name | Description
InsidePartAlongPartOrWithLeaderLinePlacingType
 Creates a new inside part along part or with leader line placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace